---
kind: type
id: T:Autodesk.Revit.DB.Visual.WallpaintFinishType
source: html/378d0061-9fcf-7b1b-b4c7-c00744d727e6.htm
---
# Autodesk.Revit.DB.Visual.WallpaintFinishType

The enumerated type representing the permitted values for the asset property "WallpaintFinish" from the "WallPaint" schema.

## Syntax (C#)
```csharp
public enum WallpaintFinishType
```